StoneRose35/cortexguitarfx/Src/stm32h750/usb.c
#include "stdlib.h"
#include "drivers/usb.h"
#include "stm32h750/stm32h750xx.h"
#include "stm32h750/stm32h750_cfg_pins.h"
#include "usb/usb_common.h"
#include "usb/usb_config.h"
#include "uart.h"

typedef  void(*endPointHandler)(void*) ;

// handlers
void(*ep0OUTHandler)(void*data)=0;
void(*ep1OUTHandler)(void*data)=0;
void(*ep2OUTHandler)(void*data)=0;
void(*ep3OUTHandler)(void*data)=0;
void(*ep4OUTHandler)(void*data)=0;
void(*ep5OUTHandler)(void*data)=0;
void(*ep6OUTHandler)(void*data)=0;
void(*ep7OUTHandler)(void*data)=0;
void(*ep8OUTHandler)(void*data)=0;

endPointHandler outHandlers[9]={0,0,0,0,0,0,0,0,0};
uint8_t * epOutBuffers[9]={0,0,0,0,0,0,0,0,0};
uint8_t * epInBuffers[9]={0,0,0,0,0,0,0,0,0};
uint16_t epOutDataCntrs[9]={0,0,0,0,0,0,0,0,0};
uint16_t epInDataCntrs[9]={0,0,0,0,0,0,0,0,0};
uint16_t epInBytesTransferred[9]={0,0,0,0,0,0,0,0,0};
uint16_t epOutMaxPacketSizes[9]={64,0,0,0,0,0,0,0,0};
uint16_t epInMaxPacketSizes[9]={64,0,0,0,0,0,0,0,0};
uint8_t ep0OutDataBfr[128];
uint8_t ep0InDataBfr[128]; 
//volatile uint16_t usbAddressChangePending;

void OTG_FS_EP1_OUT_IRQHandler(void)
{

}

void OTG_FS_EP1_IN_IRQHandler(void)
{

}

void OTG_FS_IRQHandler(void)
{
    uint32_t coreInterrupts = USB2_OTG_FS->GINTSTS;

    //usb reset, we know that we're in device mode
    if (coreInterrupts & (1 << USB_OTG_GINTSTS_USBRST_Pos))
    {
        #ifdef USB_DBG
        sendStringBlocking("USB reset\r\n");
        #endif
        // set NAK for all OUT endpoints
        //for (uint8_t c=0;c<8;c++)
        //{
        //    *((uint32_t*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_OUT_ENDPOINT_BASE + (c+1)*0x20)) |= (1 << USB_OTG_DOEPCTL_SNAK_Pos);
        //}
        // unmask interrupts: INEP0 control 0 IN endpoint
        // OUTEP0 control 0 OUT endpoint
        // STUPM setup phase done
        // XFRCM transfer completed interrupt in IN endpoint
        // XFRC transfer complete interrupt in OUT endpoint
        // TOM timeout condition in IN endpoint
        USB2_OTG_FS_DEVICE->DAINTMSK |= (1 << USB_OTG_DAINTMSK_IEPM_Pos) | (1 << USB_OTG_DAINTMSK_OEPM_Pos);
        USB2_OTG_FS_DEVICE->DOEPMSK |= (1 << USB_OTG_DOEPMSK_STUPM_Pos) | (1 << USB_OTG_DOEPMSK_XFRCM_Pos);
        USB2_OTG_FS_DEVICE->DIEPMSK |= (1 << USB_OTG_DIEPMSK_XFRCM_Pos) | (1 << USB_OTG_DIEPMSK_TOM_Pos);

        // flush all TX FIFO's
        // wait until AHB is idle
        while ((USB2_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == 0U); // maybe timeout here
        USB2_OTG_FS->GRSTCTL = ((1 << USB_OTG_GRSTCTL_TXFFLSH_Pos) | (0x10 << 6));
        // wait until flushed
        while ((USB2_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH) == USB_OTG_GRSTCTL_TXFFLSH); // maybe timeout as well

        // flush the rx FIFO
        // wait until no traffic over AHB
        while ((USB2_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == 0U); // maybe timeout here
        USB2_OTG_FS->GRSTCTL = USB_OTG_GRSTCTL_RXFFLSH; // flush the rx FIFO
        while ((USB2_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_RXFFLSH) == USB_OTG_GRSTCTL_RXFFLSH);// maybe timeout here
        USB_OTG_INEndpointTypeDef* inEndpoint;
        USB_OTG_OUTEndpointTypeDef* outEndpoint;
        for (uint8_t c = 0; c < 9; c++)
        {
            inEndpoint = ((USB_OTG_INEndpointTypeDef*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_IN_ENDPOINT_BASE + 0x20*c));
            inEndpoint->DIEPCTL = 0;
            inEndpoint->DIEPTSIZ = 0;
            inEndpoint->DIEPINT  = 0xFB7F;
        }
        for (uint8_t c=0; c < 9 ; c++)
        {
            outEndpoint = ((USB_OTG_OUTEndpointTypeDef*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_OUT_ENDPOINT_BASE + 0x20*c));
            outEndpoint->DOEPCTL = 0;
            outEndpoint->DOEPTSIZ = 0;
            outEndpoint->DOEPINT  = 0xFB7F;
        }

        // setup in endpoint 0
        inEndpoint = ((USB_OTG_INEndpointTypeDef*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_IN_ENDPOINT_BASE));
        inEndpoint->DIEPCTL = (1 << USB_OTG_DIEPCTL_USBAEP_Pos) | (0x40 << USB_OTG_DIEPCTL_MPSIZ_Pos) | USB_OTG_DIEPCTL_SD0PID_SEVNFRM;
        

        // set setupcount to 3 to receive up to 3 setup packages at once
        outEndpoint = ((USB_OTG_OUTEndpointTypeDef*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_OUT_ENDPOINT_BASE));
        outEndpoint->DOEPTSIZ = (3 << USB_OTG_DOEPTSIZ_STUPCNT_Pos) | (3*8) | (1 << USB_OTG_DOEPTSIZ_PKTCNT_Pos);

        USB2_OTG_FS->GINTMSK |= (1 << USB_OTG_GINTMSK_RXFLVLM_Pos); // switch on rx interrupt
        USB2_OTG_FS->GINTSTS |= (1 << USB_OTG_GINTSTS_USBRST_Pos);
        
        for(uint8_t c=0;c<32;c++)
        {
            ep0OutDataBfr[c]=0;
        }
        for (uint8_t c=1;c<9;c++)
        {
            free(epOutBuffers[c]);
            epOutBuffers[c]=0;
            epOutDataCntrs[c]=0;
        }
        epOutDataCntrs[0]=0;
        
    }

    // RX FIFO not empty: something has been received
    if (coreInterrupts & (1 << USB_OTG_GINTSTS_RXFLVL_Pos))
    {
        USB2_OTG_FS->GINTMSK &= ~(1 << USB_OTG_GINTMSK_RXFLVLM_Pos); // mask RX FIFO Interrupt
        //USB2_OTG_FS->GINTSTS |= (1 << USB_OTG_GINTSTS_RXFLVL_Pos);
        #ifdef USB_DBG
            sendStringBlocking("USB RX\r\n");
        #endif
        uint32_t statusRegisterPopped = USB2_OTG_FS->GRXSTSP;
        USB2_OTG_FS->GINTSTS |= (1 << USB_OTG_GINTSTS_RXFLVL_Pos); // clear RX FIFO interrupt
        uint16_t bCnt = (statusRegisterPopped >> 4) & 0x7FF;
        uint8_t epNr = (statusRegisterPopped) & 0xF;

        if (bCnt > 0)
        {
            uint16_t wordCount = (bCnt + 3) / 4;
            for (uint8_t c=0;c< wordCount;c++)
            {
                (void)((((struct T_UINT32_WRITE *)(void *)(epOutBuffers[epNr]+epOutDataCntrs[epNr]))->v)= (*((volatile uint32_t*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE))));
                epOutDataCntrs[epNr] += 4;
            }
        }
        /*
        if (epNr==0)
        {
            if (bCnt == 0 && dPid == 2) // status stage received: enpoint 0 and data pid 1, data size 0
            {
                if((usbAddressChangePending & 0xFF00) != 0)
                {
                    uint32_t dcfg = USB2_OTG_FS_DEVICE->DCFG;
                    dcfg &= ~(0x7F << USB_OTG_DCFG_DAD_Pos); 
                    dcfg |= usbAddressChangePending & 0xFF;
                    USB2_OTG_FS_DEVICE->DCFG = dcfg;
                    usbAddressChangePending =0;
                }
            }
            if (packetStatus == PKSTS_SETUP_DATA_PACKET_RECEIVED && bCnt == 8)
            {
                //setup data package received: read two words, then decode the setup information
                UsbSetupPacket setupPacket = (UsbSetupPacket)epInDataBfr;
                ProcessUsbSetupPackage(setupPacket);
                free((void*)epInDataBfr);
            }
            else if (outHandlers[0] != 0)
            {
                outHandlers[0](epInDataBfr);
            }   
        }
        else 
        {
            if (outHandlers[epNr] != 0)
            {
                outHandlers[epNr](epInDataBfr);
            }
        }
        */
       USB2_OTG_FS->GINTMSK |= (1 << USB_OTG_GINTMSK_RXFLVLM_Pos); // unmask RX FIFO Interrupt
    }

