StoneRose35/cortexguitarfx/Src/stm32h750/usb.c
    // enumeration done
    if (coreInterrupts & (1 << USB_OTG_GINTSTS_ENUMDNE_Pos))
    {
        // check that enumerated speed is correct
        #ifdef USB_DBG
        uint8_t enumeratedSpeed = (uint8_t)((USB2_OTG_FS_DEVICE->DSTS >> 1) & 0x3);
        if (enumeratedSpeed == 3)
        {
            sendStringBlocking("USB enumDone: speed correct\r\n");
        }
        else
        {
            enumeratedSpeed += 0x30;
            sendStringBlocking("USB enumDone: wrong speed ");
            sendBlocking(&enumeratedSpeed,1);
            sendStringBlocking("\r\n");
        }
        #endif
        //USB_OTG_INEndpointTypeDef * inEP = ((USB_OTG_INEndpointTypeDef*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_IN_ENDPOINT_BASE));
        //uint32_t diepctl0 = inEP->DIEPCTL; 
        //diepctl0 &= ~(0x7FF);
        //diepctl0 |= 0x40;
        //inEP->DIEPCTL = diepctl0;
        USB2_OTG_FS_DEVICE->DCTL |= (1 << USB_OTG_DCTL_CGINAK_Pos);
        USB2_OTG_FS->GINTMSK |= (1 << USB_OTG_GINTMSK_RXFLVLM_Pos); // switch on rx interrupt
        //USB2_OTG_FS->GINTSTS |= (1 << USB_OTG_GINTSTS_ENUMDNE_Pos);
        //USB_OTG_OUTEndpointTypeDef* outEndpoint = ((USB_OTG_OUTEndpointTypeDef*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_OUT_ENDPOINT_BASE));
        //__ASM("nop");
    }
    

    // usb suspended, a.k.a. cable unplugged
    if (coreInterrupts & (1 << USB_OTG_GINTSTS_USBSUSP_Pos))
    {
        #ifdef USB_DBG
            sendStringBlocking("USB susp\r\n");
        #endif
        // TODO shutdown data streams, notify user-level code that usb has been disconnected
        USB2_OTG_FS->GINTSTS |= (1 << USB_OTG_GINTSTS_USBSUSP_Pos);
    }

    // early suspend
    if (coreInterrupts & (1 << USB_OTG_GINTSTS_ESUSP_Pos))
    {
        #ifdef USB_DBG
        sendStringBlocking("USB early susp\r\n");
    #endif
        USB2_OTG_FS->GINTSTS |= (1 << USB_OTG_GINTSTS_ESUSP_Pos);
    }

    // start of frame
    if (coreInterrupts & (1 << USB_OTG_GINTSTS_SOF_Pos))
    {
        #ifdef USB_DBG
            //sendStringBlocking("USB SOF\r\n");
        #endif
        // maybe useful to measure the liveliness of the usb host...
        USB2_OTG_FS->GINTSTS |= (1 << USB_OTG_GINTSTS_SOF_Pos);
    }

    // session request
    if (coreInterrupts & (1 << USB_OTG_GINTSTS_SRQINT_Pos))
    {
        // handle session request, don't know what needs to be done yet...
        #ifdef USB_DBG
            sendStringBlocking("USB session req\r\n");
        #endif
        USB2_OTG_FS->GINTSTS |= (1 << USB_OTG_GINTSTS_SRQINT_Pos);
    }

    // mode mismatch interrupt, indicates software error or wrong cable attached/forcing the device to be host
    if (coreInterrupts & (1 << USB_OTG_GINTSTS_MMIS_Pos))
    {
        #ifdef USB_DBG
            sendStringBlocking("USB mode mismatch IRQ\r\n");
        #endif
        USB2_OTG_FS->GINTSTS |= (1 << USB_OTG_GINTSTS_MMIS_Pos);
    }



    // ----------------------------------
    // ----------------------------------
    // Endpoint interrupts
    // first read OTG_GINTSTS to determined whether it is an OUT or IN endpoint interrupt
    // then read daint to find out which endpoint has been adressed
    // do what needs to be done...
    // then clear the interrupt flag using OTG_DOEPINTx or OTG_DIEPINTx
    if ((coreInterrupts & (1 << USB_OTG_GINTSTS_OEPINT_Pos)) == (1 << USB_OTG_GINTSTS_OEPINT_Pos))
    {
        #ifdef USB_DBG
        sendStringBlocking("USB OUT EP IRQ\r\n");
        #endif
        uint32_t deviceInterrupts = (USB2_OTG_FS_DEVICE->DAINT >> 16) & 0xFFFF;
        uint8_t epNr = 0;
        while (deviceInterrupts != 0) //for (uint8_t epNr=0;epNr<9;epNr++)
        {
            if ((deviceInterrupts & 1) != 0)
            {
                
                USB_OTG_OUTEndpointTypeDef * outEndpoint = ((USB_OTG_OUTEndpointTypeDef*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_OUT_ENDPOINT_BASE + 0x20*epNr));
                
                /*uint32_t packageInfo = USB2_OTG_FS->GRXSTSP;
                uint8_t byteCount = (packageInfo >> 3) & 0x3FF;
                if ((byteCount >> 2) > 0)
                {
                    usbOUTData = (uint32_t*)malloc(byteCount);
                    for (uint8_t c=0;c<(byteCount >> 2);c++)
                    {
                        *(usbOUTData + c) = *((uint32_t*)(USB_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE));
                    }
                }*/
                if (outEndpoint->DOEPINT & (1 << USB_OTG_DOEPINT_STUP_Pos))
                {
                    // handle setup phase
                    UsbSetupPacketType * setupPacket;
                    for (uint8_t c=0; c<(epOutDataCntrs[epNr] >> 3); c++)
                    {
                        setupPacket = (UsbSetupPacketType*)(epOutBuffers[epNr] + (c << 3));
                        ProcessUsbSetupPackage(setupPacket);
                    }  
                    epOutDataCntrs[epNr]=0;                  
                }
                else if ((outEndpoint->DOEPINT & (1 << USB_OTG_DOEPINT_XFRC_Pos)) && outHandlers[epNr] != 0 && epOutBuffers[epNr] != 0)
                {
                    // TODO include size in Handlers
                    outHandlers[epNr](epOutBuffers[epNr]);
                    epOutDataCntrs[epNr]=0;
                }
                outEndpoint->DOEPINT = 0xFFFF; // clear all interrupts
            }
            deviceInterrupts >>=1;
            epNr++;
        }
    }

    if ((coreInterrupts & (1 << USB_OTG_GINTSTS_IEPINT_Pos)) == (1 << USB_OTG_GINTSTS_IEPINT_Pos))
    {
        uint32_t deviceInterrupts = USB2_OTG_FS_DEVICE->DAINT & 0xFFFF;
        uint32_t epNr = 0;
        while(deviceInterrupts != 0)
        {
            if ((deviceInterrupts & 1) == 1)
            {
                USB_OTG_INEndpointTypeDef * inEndpoint = ((USB_OTG_INEndpointTypeDef*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_IN_ENDPOINT_BASE + 0x20*epNr));
                if (inEndpoint->DIEPINT & (1 << USB_OTG_DIEPINT_XFRC_Pos)) // transmit done
                {
                    #ifdef USB_DBG
                    sendStringBlocking("USB Xfer Dne\r\n");
                    #endif
                    USB2_OTG_FS_DEVICE->DIEPEMPMSK &= ~(1 << epNr);
                    
                    if (epNr==0)
                    {

                        //uint16_t upperLimit=0;
                        // still more to send than a packet size
                        //if ((epInDataCntrs[epNr] - epInWordsTransferred[epNr]) > epInMaxPacketSizes[epNr])
                        //{
                        //    upperLimit = epInMaxPacketSizes[epNr] >> 2;
                        //}
                        if (epInDataCntrs[epNr] == epInBytesTransferred[epNr] && (epInBytesTransferred[epNr] % epInMaxPacketSizes[epNr])==0)
                        { // send a zerol length package when total length is a multiple of the maximum package size
                            sendUSBData(0,0,0);
                        }
                        //else
                        //{
                        //    upperLimit = epInDataCntrs[epNr] - epInWordsTransferred[epNr];
                        //}
                        // start reception if on endpoint 0
                        // to get status packet
                        USB_OTG_OUTEndpointTypeDef * outEndpoint = ((USB_OTG_OUTEndpointTypeDef*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_OUT_ENDPOINT_BASE + 0x20*epNr));
                        outEndpoint->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_XFRSIZ & epOutMaxPacketSizes[epNr]);
                        outEndpoint->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (1U << 19));
                        outEndpoint->DOEPCTL |= (1 << USB_OTG_DOEPCTL_CNAK_Pos) | (1 << USB_OTG_DOEPCTL_EPENA_Pos);
                    }
                }
                if (inEndpoint->DIEPINT & (1 << USB_OTG_DIEPINT_TXFE_Pos)) // transmit fifo empty
                {
                    #ifdef USB_DBG
                    sendStringBlocking("USB TX Fifo empty\r\n");
                    #endif
                    uint16_t upperLimit=0;
                    if ((epInDataCntrs[epNr] - epInBytesTransferred[epNr]) > (epInMaxPacketSizes[epNr]))
                    {
                        upperLimit = epInMaxPacketSizes[epNr];
                    }
                    else
                    {
                        upperLimit = epInDataCntrs[epNr] - epInBytesTransferred[epNr];
                    }
                    uint16_t wordCount = (upperLimit + 3)/4;
                    for (uint16_t c=0;c<wordCount;c++)
                    {
                        *((volatile uint32_t *)(USB_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + epNr * USB_OTG_FIFO_SIZE)) = (((const struct T_UINT32_READ *)(const void *)(epInBuffers[epNr]))->v);
                        epInBuffers[epNr]+=4;
                    }   
                    epInBytesTransferred[epNr] += upperLimit;
                }
                inEndpoint->DIEPINT = 0xFFFF;
                if (epInBytesTransferred[epNr] >= epInDataCntrs[epNr])
                {
                    USB2_OTG_FS_DEVICE->DIEPEMPMSK &= ~(1 << epNr);
                }
            }

            deviceInterrupts >>= 1;
            epNr++;
        }
        USB2_OTG_FS->GINTSTS |= (1 << USB_OTG_GINTSTS_IEPINT_Pos);   
    }

