StoneRose35/cortexguitarfx/Src/stm32h750/usb.c
}

void initUSB()
{
// ---------------------
// - GPIO's and clocks -
// ---------------------
//
// enable USB voltage detector 
PWR->CR3 |=(1 << PWR_CR3_USB33DEN_Pos); 

// enable GPIO A
RCC->AHB4ENR |= (1 << RCC_AHB4ENR_GPIOAEN_Pos);
// set pll's and clock's
// enable HSI48
RCC->CR |= (1 << RCC_CR_HSI48ON_Pos);
while (!(RCC->CR && (1 << RCC_CR_HSI48RDY_Pos)));
// multiplex HSI48 to the usb block
RCC->D2CCIP2R |= (3 << RCC_D2CCIP2R_USBSEL_Pos);

// enable usb2 clock
RCC->AHB1ENR |= (1 << RCC_AHB1ENR_USB2OTGHSEN_Pos);

// --------------------------
// - Wire up pin's
// --------------------------
// connect to daisy usb D1 and D- pins to the USB PHY
//OTG_FS_DM: PA11
//OTG_FS_DP: PA12
//OTG_FS_ID: PA10
// PORTA has 0 offset from base
GPIO_TypeDef * portA = ((GPIO_TypeDef*)(GPIOA_BASE + 0*0x400));
uint32_t regval;
regval = portA->AFR[1];
regval &= ~((0xF << (4*4))) | (0xF << (3*4));
regval |= (10 << (3*4)) | (10 << (4*4));
portA->AFR[1] = regval;
regval = portA->MODER;
regval &= ~((0x3 << (11*2)) | (0x3 << (12*2)));
regval |= (0x2 << (11*2)) | (0x2 << (12*2));
portA->MODER = regval; // mode alternate function
regval = portA->PUPDR;
regval &= ~((0x3 << (11*2)) | (0x3 << (12*2))); // no pullup/pulldown
portA->PUPDR = regval;
regval = portA->OSPEEDR;
regval &= ~((0x3 << (11*2)) | (0x3 << (12*2))); // slow speed
portA->OSPEEDR = regval;

// pa9 (vbus) as input
regval = portA->AFR[1];
regval &= ~(0xF << (1*4));
portA->AFR[1] = regval;
regval = portA->MODER;
regval &= ~(0x3 << (9*2));
portA->MODER = regval;
regval = portA->PUPDR;
regval &= ~(0x3 << (9*2));
portA->PUPDR = regval;
regval = portA->OSPEEDR;
regval &= ~(0x3 << (9*2));
portA->OSPEEDR = regval;

// --------------------------
// - USB Core initialization
// --------------------------

USB2_OTG_FS->GUSBCFG |= (1 << USB_OTG_GUSBCFG_PHYSEL_Pos); // set internal USB PHY

// core clock reset
while (!(USB2_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL));
USB2_OTG_FS->GRSTCTL |= USB_OTG_GRSTCTL_CSRST;
while ((USB2_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_CSRST) == USB_OTG_GRSTCTL_CSRST);

USB2_OTG_FS->GCCFG |= (1 << USB_OTG_GCCFG_PWRDWN_Pos); // enable usb transceiver
USB2_OTG_FS->GUSBCFG |= (1 << USB_OTG_GUSBCFG_FDMOD_Pos); // for device mode to be able to access device registers

//for (uint8_t c=0;c<15;c++)
//{
//    USB2_OTG_FS->DIEPTXF[c]=0U;
//}

// disable VBUS sensing
USB2_OTG_FS_DEVICE->DCTL |= (1 << USB_OTG_DCTL_SDIS_Pos);
USB2_OTG_FS->GCCFG &= ~(1 << USB_OTG_GCCFG_VBDEN_Pos);
USB2_OTG_FS->GOTGCTL |= (1 << USB_OTG_GOTGCTL_BVALOEN_Pos) | (1 << USB_OTG_GOTGCTL_BVALOVAL_Pos);

// restart PHY clock, set Register PCGCCTL to zero which is too far away to be part of the structure
*(volatile uint32_t*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_PCGCCTL_BASE)=0;

USB2_OTG_FS_DEVICE->DCFG |= (3 << USB_OTG_DCFG_DSPD_Pos); // speed is internal phy, full speed

// flush all TX FIFO's
// wait until AHB is idle
//while ((USB2_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == 0U); // maybe timeout here
//USB2_OTG_FS->GRSTCTL = ((1 << USB_OTG_GRSTCTL_TXFFLSH_Pos) | (0x10 << 6));
// wait until flushed
//while ((USB2_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH) == USB_OTG_GRSTCTL_TXFFLSH); // maybe timeout as well

// flush the rx FIFO
// wait until no traffic over AHB
//while ((USB2_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == 0U); // maybe timeout here
//USB2_OTG_FS->GRSTCTL = USB_OTG_GRSTCTL_RXFFLSH; // flush the rx FIFO
//while ((USB2_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_RXFFLSH) == USB_OTG_GRSTCTL_RXFFLSH);// maybe timeout here

// mask all device interrupts
USB2_OTG_FS_DEVICE->DIEPMSK = 0;
USB2_OTG_FS_DEVICE->DOEPMSK = 0;
USB2_OTG_FS_DEVICE->DAINTMSK = 0;

// config all 9 endpoints
for (uint8_t c = 0; c < 9; c++)
{
  ((USB_OTG_INEndpointTypeDef*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_IN_ENDPOINT_BASE + 0x20*c))->DIEPCTL = 0;
  ((USB_OTG_INEndpointTypeDef*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_IN_ENDPOINT_BASE + 0x20*c))->DIEPTSIZ = 0;
  ((USB_OTG_INEndpointTypeDef*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_IN_ENDPOINT_BASE + 0x20*c))->DIEPINT  = 0x2B7F; // according to dataset //0xFB7F;
}
for (uint8_t c=0; c < 9 ; c++)
{
    ((USB_OTG_OUTEndpointTypeDef*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_OUT_ENDPOINT_BASE + 0x20*c))->DOEPCTL = 0;
    ((USB_OTG_OUTEndpointTypeDef*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_OUT_ENDPOINT_BASE + 0x20*c))->DOEPTSIZ = 0;
    ((USB_OTG_OUTEndpointTypeDef*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_OUT_ENDPOINT_BASE + 0x20*c))->DOEPINT  = 0x2B7F; // according to dataset //0xFB7F;
}

//USB2_OTG_FS_DEVICE->DIEPMSK &= ~(1 << USB_OTG_DIEPEACHMSK1_TXFURM_Pos); // mask TX underrun interrupt, pretty useless since all interrupts have meen masked before

USB2_OTG_FS->GINTMSK = 0; // mask all usb interrupts
USB2_OTG_FS->GINTSTS = 0xBFFFFFFF; // clear pending interrupts
// umask all device mode interrupts
USB2_OTG_FS->GINTMSK |= USB_OTG_GINTMSK_USBSUSPM | USB_OTG_GINTMSK_USBRST |
USB_OTG_GINTMSK_ENUMDNEM | USB_OTG_GINTMSK_IEPINT |
USB_OTG_GINTMSK_OEPINT   | USB_OTG_GINTMSK_IISOIXFRM |
USB_OTG_GINTMSK_PXFRM_IISOOXFRM | USB_OTG_GINTMSK_WUIM;

USB2_OTG_FS_DEVICE->DCFG &= ~(0x7F << USB_OTG_DCFG_DAD_Pos); // set device address 0

// set fifo sizes
USB2_OTG_FS->GRXFSIZ = 0x80; // receiver fifo
USB2_OTG_FS->DIEPTXF0_HNPTXFSIZ = (0x40 << 16) | 0x80; // transmit fifo 0 
//USB2_OTG_FS->DIEPTXF[0] = ((uint32_t)0x80 << 16) | (0x80 + 0x40); // transmit fifo 1

// start phy clock and stop HCLK gating
*(volatile uint32_t*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_PCGCCTL_BASE) &= ~((1 << USB_OTG_PCGCCTL_GATECLK_Pos) | (1 << USB_OTG_PCGCCTL_STOPCLK_Pos));
USB2_OTG_FS_DEVICE->DCTL |= (1 << USB_OTG_DCTL_SDIS_Pos); // soft diconnect
USB2_OTG_FS->GAHBCFG |= (1 << USB_OTG_GAHBCFG_GINT_Pos); // unmask global interrupt
USB2_OTG_FS_DEVICE->DCTL &= ~(1 << USB_OTG_DCTL_SDIS_Pos); // finally: connect!

//NVIC: Enable USB interrupts
NVIC_EnableIRQ(OTG_FS_IRQn);



outHandlers[0]=ep0OUTHandler;
outHandlers[1]=ep1OUTHandler;
outHandlers[2]=ep2OUTHandler;
outHandlers[3]=ep3OUTHandler;
outHandlers[4]=ep4OUTHandler;
outHandlers[5]=ep5OUTHandler;
outHandlers[6]=ep6OUTHandler;
outHandlers[7]=ep7OUTHandler;
outHandlers[8]=ep8OUTHandler;

for(uint8_t c=0;c<128;c++)
{
    ep0OutDataBfr[c]=0;
    ep0InDataBfr[c]=0;
}
for (uint8_t c=1;c<9;c++)
{
    free(epOutBuffers[c]);
    epOutBuffers[c]=0;
    epOutDataCntrs[c]=0;
    epInBuffers[c]=0;
    epInDataCntrs[c]=0;
}
epOutBuffers[0]=ep0OutDataBfr;
epInBuffers[0]=ep0InDataBfr;
epOutDataCntrs[0]=0;
epInDataCntrs[0]=0;
}

uint8_t * getEp0InDataBfr()
{
    return ep0InDataBfr;
}

/**
 * sends data out over usb
 * epNr: the endpoint number starting at 0
 * data: pointer to the data to be sent
 * dlen: length of the data
 */
void sendUSBData(uint8_t epNr,uint8_t*data,uint16_t dlen)
{
    USB_OTG_INEndpointTypeDef * inEndpoint = ((USB_OTG_INEndpointTypeDef*)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_IN_ENDPOINT_BASE + epNr*0x20));
    uint32_t epCtrl = inEndpoint->DIEPCTL;
    uint16_t npackets;

    if(dlen==0)
    {
        npackets = 1;
    }
    else
    {
        npackets = ((dlen + epInMaxPacketSizes[epNr] - 1) / epInMaxPacketSizes[epNr]);
    }
    

    inEndpoint->DIEPTSIZ =  (npackets << USB_OTG_DIEPTSIZ_PKTCNT_Pos) | dlen;
    epCtrl |= (1 << USB_OTG_DIEPCTL_EPENA_Pos) | (1 << USB_OTG_DIEPCTL_CNAK_Pos);
    inEndpoint->DIEPCTL = epCtrl;
    USB2_OTG_FS_DEVICE->DIEPEMPMSK |= 1UL << epNr;

    epInBuffers[epNr] = data;
    epInBytesTransferred[epNr]=0;
    epInDataCntrs[epNr] = dlen;
}

void setAddress(uint8_t address)
{
    //usbAddressChangePending = 0xFF00 | address;
    uint32_t dcfg = USB2_OTG_FS_DEVICE->DCFG;
    dcfg &= ~(0x7F << USB_OTG_DCFG_DAD_Pos); 
    dcfg |= (address & 0xFF) << USB_OTG_DCFG_DAD_Pos;
    USB2_OTG_FS_DEVICE->DCFG = dcfg;
    sendUSBData(0,0,0);
}